<template>
    <div class="container">
        <ul class="sort" @click="next">
            <li>用户协议</li>
            <li>隐私政策</li>
        </ul>
        <swiper ref="swiper" class="no-selection" :options="swiper1">
            <swiper-slide class="text">
                <section>
                    <h1>用户协议</h1>
                    <p align="center"><b>生效日期：2019 年 1 月 24 日</b></p>
                    <p>在此特别提醒您（用户）在注册成为用户之前，请认真阅读本《用户协议》（以下简称“协议”），确保您充分理解本协议中各条款。请您审慎阅读并选择接受或不接受本协议。除非您接受本协议所有条款，否则您无权注册、登录或使用本协议所涉服务。您的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。</p>
                    <h2>一、帐号注册</h2>

                    <p>1、用户在使用本服务前需要注册一个“JULONE”帐号。“JULONE”帐号应当使用手机号码绑定注册，请用户使用尚未与“JULONE”帐号绑定的手机号码，以及未被JULONE根据本协议封禁的手机号码注册“JULONE”帐号。JULONE可以根据用户需求或产品需要对帐号注册和绑定的方式进行变更，而无须事先通知用户。</p>
                    <p>2、用户完成注册即表明用户同意JULONE提取、公开及使用用户的地理位置信息。如用户需要终止向其他用户公开其地理位置信息，可自行设置为隐身状态。</p>
                    <p>3、在用户注册及使用本服务时，JULONE需要搜集能识别用户身份的个人信息以便JULONE可以在必要时联系用户，或为用户提供更好的使用体验。JULONE搜集的信息包括但不限于用户的姓名、性别、年龄、出生日期、身份证号、地址、学校情况、公司情况、所属行业、兴趣爱好、常出没的地方、个人说明；JULONE同意对这些信息的使用将受限于第三条用户个人隐私信息保护的约束。</p>

                    <h2>二、服务内容</h2>

                    <p>1、本服务的具体内容由JULONE根据实际情况提供，包括但不限于授权用户通过其帐号进行即时通讯、添加好友、加入群组、关注他人、发布留言。JULONE可以对其提供的服务予以变更，且JULONE提供的服务内容可能随时变更；用户将会收到JULONE关于服务变更的通知。</p>
                    <p>2、JULONE提供的服务包含免费服务与收费服务。用户可以通过付费方式购买收费服务，具体方式为：用户通过网上银行、支付宝或其他“JULONE”平台提供的付费途径支付一定数额的人民币购买“JULONE”平台的虚拟货币——JULONE币，然后根据JULONE公布的资费标准以JULONE币购买用户欲使用的收费服务，从而获得收费服务使用权限。对于收费服务，JULONE会在用户使用之前给予用户明确的提示，只有用户根据提示确认其同意按照前述支付方式支付费用并完成了支付行为，用户才能使用该等收费服务。支付行为的完成以银行或第三方支付平台生成“支付已完成”的确认通知为准。</p>


                    <h2>三、内容规范</h2>

                    <p>1、本条所述内容是指用户使用本服务过程中所制作、上载、复制、发布、传播的任何内容，包括但不限于帐号头像、名称、用户说明等注册信息及认证资料，或文字、语音、图片、视频、图文等发送、回复或自动回复消息和相关链接页面，以及其他使用帐号或本服务所产生的内容。</p>
                    <p>2、用户不得利用“JULONE”帐号或本服务制作、上载、复制、发布、传播如下法律、法规和政策禁止的内容：</p>
                    <p>(1) 反对宪法所确定的基本原则的；</p>
                    <p>(2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
                    <p>(3) 损害国家荣誉和利益的；</p>
                    <p>(4) 煽动民族仇恨、民族歧视，破坏民族团结的；</p>
                    <p>(5) 破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
                    <p>(6) 散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
                    <p>(7) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>


                    <h2>四、使用规则</h2>

                    <p>1、用户在本服务中或通过本服务所传送、发布的任何内容并不反映或代表，也不得被视为反映或代表JULONE的观点、立场或政策，JULONE对此不承担任何责任。</p>
                    <p>2、用户不得利用“JULONE”帐号或本服务进行如下行为：</p>
                    <p>(1) 提交、发布虚假信息，或盗用他人头像或资料，冒充、利用他人名义的；</p>
                    <p>(2) 强制、诱导其他用户关注、点击链接页面或分享信息的；</p>
                    <p>(3) 虚构事实、隐瞒真相以误导、欺骗他人的；</p>
                    <p>(4) 利用技术手段批量建立虚假帐号的；</p>
                    <p>(5) 利用“JULONE”帐号或本服务从事任何违法犯罪活动的；</p>


                    <h2>五、账户管理</h2>

                    <p>1、
                        “JULONE”帐号的所有权归JULONE所有，用户完成申请注册手续后，获得“JULONE”帐号的使用权，该使用权仅属于初始申请注册人，禁止赠与、借用、租用、转让或售卖。JULONE因经营需要，有权回收用户的“JULONE”帐号。</p>
                    <p>2、用户可以通过1）查看与编辑个人资料页，2）“设置”页面里的“账号与安全”页面来查询、更改、删除、注销“JULONE”帐户上的个人资料、注册信息及传送内容等，但需注意，删除有关信息的同时也会删除用户储存在系统中的文字和图片。用户需承担该风险。</p>
                    <p>3、用户有责任妥善保管注册帐号信息及帐号密码的安全，因用户保管不善可能导致遭受盗号或密码失窃，责任由用户自行承担。用户需要对注册帐号以及密码下的行为承担法律责任。用户同意在任何情况下不使用其他用户的帐号或密码。在用户怀疑他人使用其帐号或密码时，用户同意立即通知JULONE。</p>
                    <p>4、用户应遵守本协议的各项条款，正确、适当地使用本服务，如因用户违反本协议中的任何条款，JULONE在通知用户后有权依据协议中断或终止对违约用户“JULONE”帐号提供服务。同时，JULONE保留在任何时候收回“JULONE”帐号、用户名的权利。</p>

                    <h2>六、数据储存</h2>

                    <p>1、JULONE不对用户在本服务中相关数据的删除或储存失败负责。</p>
                    <p>2、JULONE可以根据实际情况自行决定用户在本服务中数据的最长储存期限，并在服务器上为其分配数据最大存储空间等。用户可根据自己的需要自行备份本服务中的相关数据。</p>
                    <p>3、如用户停止使用本服务或本服务终止，JULONE可以从服务器上永久地删除用户的数据。本服务停止、终止后，JULONE没有义务向用户返还任何数据。</p>

                    <h2>七、知识产权声明</h2>

                    <p>1、除本服务中涉及广告的知识产权由相应广告商享有外，JULONE在本服务中提供的内容（包括但不限于网页、文字、图片、音频、视频、图表等）的知识产权均归JULONE所有，但用户在使用本服务前对自己发布的内容已合法取得知识产权的除外。</p>
                    <p>2、除另有特别声明外，JULONE提供本服务时所依托软件的著作权、专利权及其他知识产权均归JULONE所有。</p>
                    <p>3、JULONE在本服务中所涉及的图形、文字或其组成，以及其他JULONE标志及产品、服务名称（以下统称“JULONE标识”），其著作权或商标权归JULONE所有。未经JULONE事先书面同意，用户不得将JULONE标识以任何方式展示或使用或作其他处理，也不得向他人表明用户有权展示、使用、或其他有权处理JULONE标识的行为。</p>

                </section>

            </swiper-slide>
            <swiper-slide class="text">
                <div class="content">
                    <div>
                        <h1>隐私政策</h1>
                        <p align="center"><b>生效日期：2019 年 1 月 24 日</b></p>
                        <p>我们承诺保护您的隐私和数据。我们绝不销售您的数据。我们仅在您的允许下收集和使用您的数据。</p>
                        <br>
                        <p>您拥有以下权利：</p>
                        <ul>
                            <li><b>访问权。</b>您可随时查看我们收集了哪些数据。</li>
                        </ul>
                        <ul>
                            <li><b>数据获取权。</b>数据归您所有。您可随时进行复制或移动。</li>
                        </ul>
                        <ul>
                            <li><b>删除权。</b>我们将在您的要求下，删除您的个人数据。即使您未要求我们进行删除，我们也只会在有助于我们为您提供服务的情况下保留数据。</li>
                        </ul>
                        <ul>
                            <li><b>限制使用权。</b>如果您希望我们停止使用您的数据，我们会停止。</li>
                        </ul>
                        <ul>
                            <li><b>投诉权。</b>我们会保护您的隐私、尊重您的选择。如果您认为我们在任何方面做得不好，您有权向您所在地区的数据保护机构投诉。</li>
                        </ul>
                        <p><b>我们可能需要的数据类型</b></p>
                        <p>我们将仅要求您提供能够帮助我们的产品满足您需求的数据。根据您所使用的产品和服务，我们将仅要求我们所需的最少数据。若您不想共享您的数据，我们的某些产品可能无法工作，或者无法正常工作。下面是我们可能需要的一些信息：</p>
                        <ul>
                            <li>您的联系信息，包括姓名、电子邮件地址、电话号码和收件地址，以便我们能够联系您或将您要求的产品配送给您；</li>
                            <li>您的出生日期，以便我们能验证年龄；</li>
                            <li>您的地理区域，包括居住的城市和州/省，以便我们能遵守当地法律；</li>
                            <li>您的设备和网络配置、用于打游戏和日常使用的软件以及系统性能，以便我们能优化您的游戏硬件和软件。</li>
                        </ul>
                        <p><i>收集额外数据可帮助我们为各地的游戏玩家改进我们的产品。</i>为帮助我们为您及各地的游戏玩家提供最佳体验，我们想收集一些关于您的游戏系统及其性能的额外信息。但只有经过您的同意后，我们才会这样做。额外数据包括：</p>
                        <ul>
                            <li>您的设备或网络的技术信息，以便我们找到某些设备和配置存在的问题；</li>
                            <li>您的错误数据，以便我们了解这些错误并进行修复；</li>
                            <li>您的崩溃数据，以便我们找到并修复漏洞。</li>
                        </ul>
                        <p>我们可能根据我们的商业预测和新产品开发兴趣，分析我们所收集到的数据。另外，如果您同意，我们可能利用这些数据来识别接收游戏、应用程序、奖励或相关广告的特定受众，包括您自己。</p>

                        <ul>
                            <li>浏览器类型、设备类型、URL 地址、IP 地址或操作系统类型，以改善我们的网站、防止欺诈活动、了解访客如何使用我们的网站以及提供个性化内容；</li>
                            <li>地理位置数据，以了解访客的居住地，并针对您的位置提供相应内容；</li>
                            <li>Cookie 数据，以使我们的网页个性化或提供相关广告。</li>
                        </ul>
                        <br>
                        <p><b>企业关系</b></p>
                        <p>若您与我们有业务往来，或您注册订阅了我们的商业文学、新闻通讯、会议或在线研讨会，我们可能使用来自第三方的信息获取或补充您的数据，比如：您的公司名称或职称。我们可能使用这些信息向您展示个性化的网站内容。我们还可能与JULONE代表或业务合作伙伴共享您的联系信息，以便他们可就JULONE品牌产品或服务与您进行沟通。</p>

                        <br>
                        <p>本政策的更新内容将发布在 julone.cf 上。&nbsp;</p>

                    </div>
                </div>
            </swiper-slide>
        </swiper>
        <getTop />
        <appFoot></appFoot>
    </div>
</template>
<script>
    import getTop from "./../components/Common/Top.vue";
    import appFoot from "./../components/Footer.vue";
    export default {
        data() {
            return {
                swiper1: {
                    slidesPerView: '1',
                    loop: true,
                    autoHeight: true,
                    scrollbar: {
                        el: '.swiper-scrollbar'
                    },
                    effect: 'fade',
                    fadeEffect: {
                        crossFade: true,
                    },
                    on: {
                        slideChange: function () {
                            window.scrollTo(0, 0);
                            $(".sort li").eq(this.realIndex).addClass('active').siblings('li').removeClass('active')
                        }
                    }
                }
            }
        },
        components: {
            getTop,
            appFoot
        },
        watch: {},
        methods: {
            next() {
                this.$refs.swiper.swiper.slideNext();
            }
        },
        computed: {
            realIndex() {
                return this.$refs.swiper.swiper.realIndex
            }
        },
        mounted() {
            if (this.$route.query.mode == 'privacy') {
                this.$refs.swiper.swiper.slideToLoop(1, 0)
            } else {
                $('.sort li:eq(0)').addClass('red')
            }
        },

    }
</script>
<style lang="less" scoped>
    .container {
        .max {
            max-width: 800px;
            width: 100%;
            margin: 0 auto;
        }

        padding: 1rem;
        .max;

        .active {
            background: #65686a;
            color: white;
        }

        .sort {
            display: flex;
            list-style: none;
            .max;

            li {
                width: 50%;
                text-align: center;
                padding: 12px;
                border: 1px solid rgba(128, 128, 128, 0.35);
                transition: all ease .51s;

                &:nth-child(1) {
                    border-radius: 100px 0 0 100px;
                }

                &:nth-child(2) {
                    border-radius: 0 100px 100px 0;
                }
            }
        }

        .swiper-container {
            .max;

            .swiper-slide.text {
                text-align: left !important;
                background: #f8f8f8;
                height: auto;
                box-sizing: border-box;
                padding: 15px 30px;
                font-size: .9rem;
                font-family: '等线';
                font-weight: 500;
                line-height: 1.3rem;

                & * {
                    color: #2e2e2e;
                    letter-spacing: 1px;
                    font-weight: 500;
                }

                h1 {
                    .center;
                    font-weight: 600;
                }

                .center {
                    text-align: center;
                }

                p {
                    margin: 1rem 0;
                }
            }
        }
    }
</style>